index=* EventCode=3
(Image="*\\powershell.exe" OR Image="*\\cmd.exe" OR Image="*\\wscript.exe" OR Image="*\\cscript.exe" OR Image="*\\rundll32.exe" OR Image="*\\mshta.exe")
| table _time host User Image DestinationIp DestinationHostname DestinationPort Protocol
| sort -_time
